NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
            case BUTTON_4:
            default:
				back = true;
                done = true;
                break;
        }
    }
	return back;
}

bool test_param_adjust_page_2(void)
{
    bool done = false;
	bool back = false;

    while (!done)
    {
        NRF_LOG_INFO("Adjust test parameters.\r\n");
        NRF_LOG_INFO(" 1) Turn on/off Data length extension (DLE).\r\n");
		NRF_LOG_INFO(" 2) Select preferred PHY.\r\n")
		NRF_LOG_INFO(" 3) Next page.\r\n");
		NRF_LOG_INFO(" 4) Back.\r\n")
        NRF_LOG_FLUSH();
		
		display_clear();
		
		display_test_params_print();
		
		//display_print_line_inc("Adjust test parameters");
        display_print_line_inc(" 1) Turn on/off Data length ext. (DLE)");
        display_print_line_inc(" 2) Select preferred PHY.");
		display_print_line_inc(" 3) Next page.");
        display_print_line_inc(" 4) Back.");
        display_show();

        switch (button_read())
        {
            case BUTTON_1:
                data_len_ext_select();
                break;

            case BUTTON_2:
                preferred_phy_select();
                break;

            case BUTTON_3:
                done = true;
                break;

            case BUTTON_4:
            default:
				back = true;
                done = true;
                break;
        }
    }
	return back;
}

bool test_param_adjust_page_3(void)
{
    bool done = false;
	bool back = false;

    while (!done)
    {
        NRF_LOG_INFO("Adjust test parameters.\r\n");
		NRF_LOG_INFO(" 1) Turn on/off Connection Event ext.\r\n");
        NRF_LOG_INFO(" 2) Select transfer data size.\r\n");
		NRF_LOG_INFO(" 3) Next page.\r\n");
		NRF_LOG_INFO(" 4) Back.\r\n")
        NRF_LOG_FLUSH();
		
		display_clear();
		
		display_test_params_print();
		
		display_print_line_inc(" 1) Turn on/off Connection Event ext.");
        display_print_line_inc(" 2) Select transfer data size.");
		display_print_line_inc(" 3) Next page.");
        display_print_line_inc(" 4) Back.");
        display_show();

        switch (button_read())
        {
            case BUTTON_1:
				conn_evt_ext_select();
                break;
			
			case BUTTON_2:
				transfer_data_length_select();
				break;

            case BUTTON_3:
                done = true;
                break;

            case BUTTON_4:
                back = true;
                done = true;
            default:
				
                break;
        }
    }
	return back;
}

void test_param_adjust(void)
{
	bool back = false;
	uint8_t page = 0;
	
	while(!back)
	{
		if(page == 0)
		{
			back = test_param_adjust_page_1();
			page++;
		}
		else if(page == 1)
		{
			back = test_param_adjust_page_2();
			page++;
		}
		else
		{
			back = test_param_adjust_page_3();
			page = 0;
		}
	}
}

void test_params_print(void)
{
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_INFO("Current test configuration:\r\n");
    NRF_LOG_INFO("===============================\r\n");
    NRF_LOG_INFO("ATT MTU size: %d\r\n", m_test_params.att_mtu);
	NRF_LOG_INFO("Preferredy PHY: %s\r\n", phy_str(m_test_params.rxtx_phy));
    NRF_LOG_INFO("Conn. interval: 0x%x\r\n", m_test_params.conn_interval);
    NRF_LOG_INFO("Data length extension (DLE): %s\r\n", m_test_params.data_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
    NRF_LOG_INFO("Conn. event length ext.: %s\r\n", m_test_params.conn_evt_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
    NRF_LOG_INFO("===============================\r\n");
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_FLUSH();
    
}

void display_test_params_print()
{
	char str[50];
	uint16_t number_pos = 220;
	
	sprintf(str, "%d bytes", m_test_params.att_mtu);
	display_print_line(str, number_pos, display_get_line_nr());
	display_print_line_inc("ATT MTU size:");
	
	
	sprintf(str, "%s\r\n", phy_str(m_test_params.rxtx_phy));
	display_print_line(str, number_pos, display_get_line_nr());
	display_print_line_inc("Preferredy PHY:");
	
    sprintf(str, "%.2f ms", (float)m_test_params.conn_interval * 1.25);
	display_print_line(str, number_pos, display_get_line_nr());
	display_print_line_inc("Conn. interval:");
    
	sprintf(str, "%s", m_test_params.data_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
	display_print_line(str, number_pos, display_get_line_nr());
	display_print_line_inc("Data length ext. (DLE):");
	
	sprintf(str, "%s", m_test_params.conn_evt_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
	display_print_line(str, number_pos, display_get_line_nr());
	display_print_line_inc("Connection Event ext:");
	
	sprintf(str, "%d KB", m_transfer_data.kb_transfer_size);
	display_print_line(str, number_pos, display_get_line_nr());
	display_print_line_inc("Transfer data size:");
}


void test_begin(void)
{
    NRF_LOG_INFO("Preparing the test.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();

    if (m_board_role == BOARD_TESTER)
    {
        scan_start();
    }
    if (m_board_role == BOARD_DUMMY)
    {
        advertising_start();
    }
}


void menu_print(void)
{
    bool begin_test = false;

    while (!begin_test)
    {
		display_clear();
        test_params_print();
		display_test_params_print();
		
        NRF_LOG_INFO("Select an option:\r\n");
        NRF_LOG_INFO(" 1) Run single transfer.\r\n");
		NRF_LOG_INFO(" 2) Run continuous transfer.\r\n");
        NRF_LOG_INFO(" 3) Adjust test parameters.\r\n");
        NRF_LOG_FLUSH();

		display_print_line_inc("Select an option:");
        display_print_line_inc(" 1) Run single transfer.");
		display_print_line_inc(" 2) Run continuous transfer.");
        display_print_line_inc(" 3) Adjust test parameters.");
		display_show();
		
        switch (button_read())
        {
            case BUTTON_1:
                begin_test = true;
				m_test_continuous = false;
                test_begin();
                break;

			case BUTTON_2:
                begin_test = true;
				m_test_continuous = true;
                test_begin();
                break;
			
            case BUTTON_3:
                test_param_adjust();
                break;
        }
    }

	m_transfer_data.last_throughput = 0;
    m_print_menu = false;
}


static bool is_test_ready()
{
    if (   (m_board_role == BOARD_TESTER)
        && m_conn_interval_configured
        && m_notif_enabled
        && m_mtu_exchanged
        && m_phy_updated
        && !m_run_test)
    {
        return true;
    }
    return false;
}

//for testing the throughput by measuring the distance between each packet using logic analyzer or oscilloscope
void radio_ppi_gpiote_init()
{
	NRF_GPIOTE->CONFIG[7] =   (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
							| (GPIOTE_CONFIG_OUTINIT_High << GPIOTE_CONFIG_OUTINIT_Pos)
							| (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos)
							| (0 << GPIOTE_CONFIG_PORT_Pos)
							| (16 << GPIOTE_CONFIG_PSEL_Pos);
	
